Repository: Taku1991/PokeBot
Catalog: SysBot.Pokemon.Discord/Resources/Localization.*.resx
Languages: de

# Trade_NoTradesYet
source: {0}, you haven't made any trades yet. Start trading to earn your first medal!
de: {0}, du hast noch keine Tausche gemacht. Beginne zu tauschen, um deine erste Medaille zu verdienen!

# Trade_TooManyMentions
source: Too many mentions. Queue one user at a time.
de: Zu viele Erwähnungen. Füge nur einen Benutzer gleichzeitig zur Warteschlange hinzu.

# Trade_MustMentionUser
source: A user must be mentioned in order to do this.
de: Ein Benutzer muss erwähnt werden, um dies zu tun.

# Trade_QueueFull
source: Queue is full! Unable to add: {0}
de: Warteschlange ist voll! Kann nicht hinzufügen: {0}

# Trade_Added
source: Added {0} to the queue.
de: {0} zur Warteschlange hinzugefügt.

# Trade_InvalidCode
source: Invalid trade code!
de: Ungültiger Tauschcode!

# Trade_NoAttachment
source: No file attachment provided!
de: Keine Datei als Anhang bereitgestellt!

# Trade_Summary
source: Makes the bot trade you a Pokémon converted from the provided Showdown Set.
de: Lässt den Bot dir ein Pokémon tauschen, das aus dem bereitgestellten Showdown-Set konvertiert wurde.

# HideTrade_Summary
source: Makes the bot trade you a Pokémon without showing trade embed details.
de: Lässt den Bot dir ein Pokémon tauschen, ohne die Tausch-Embed-Details anzuzeigen.

# Medals_Summary
source: Shows your current trade count and medal status
de: Zeigt deine aktuelle Tauschanzahl und deinen Medaillenstatus an

# Egg_Summary
source: Orders an egg based on the provided Showdown Set.
de: Bestellt ein Ei basierend auf dem bereitgestellten Showdown-Set.

# FixOT_Summary
source: Fixes the OT data of a Pokémon by using the provided Showdown Set.
de: Korrigiert die OT-Daten eines Pokémon mithilfe des bereitgestellten Showdown-Sets.

# Queue_Position
source: You are in position {0} in the queue.
de: Du bist an Position {0} in der Warteschlange.

# Queue_NotInQueue
source: You are not currently in the queue.
de: Du bist derzeit nicht in der Warteschlange.

# Queue_Removed
source: Removed you from the queue.
de: Du wurdest aus der Warteschlange entfernt.

# Hub_Summary
source: Summary
de: Zusammenfassung

# Hub_Counts
source: Counts
de: Anzahl

# Hub_QueuesEmpty
source: Queues are empty.
de: Warteschlangen sind leer.

# Trade_LegalizationTimeout
source: Set took too long to legalize.
de: Die Legalisierung des Sets hat zu lange gedauert.

# Trade_QueueList
source: These are the users who are currently waiting:
de: Diese Benutzer warten derzeit:

# Trade_BatchProcessing
source: {0} Processing your batch trade with {1} Pokémon...
de: {0} Verarbeite deinen Batch-Tausch mit {1} Pokémon...

# Trade_BatchError
source: {0} An error occurred while processing your batch trade. Please try again.
de: {0} Ein Fehler ist beim Verarbeiten deines Batch-Tauschs aufgetreten. Bitte versuche es erneut.

# Trade_AlreadyInQueue
source: You already have an existing trade in the queue that cannot be cleared. Please wait until it is processed.
de: Du hast bereits einen laufenden Tausch in der Warteschlange, der nicht entfernt werden kann. Bitte warte, bis er verarbeitet wurde.

# Trade_EggGenerationTimeout
source: Egg generation took too long.
de: Die Ei-Generierung hat zu lange gedauert.

# Trade_EggGenerationFailed
source: Failed to generate egg from the provided set.
de: Konnte kein Ei aus dem bereitgestellten Set generieren.

# Trade_EggConversionFailed
source: Oops! I wasn't able to create an egg for that.
de: Hoppla! Ich konnte dafür kein Ei erstellen.

# Embed_Notice_Title
source: Notice
de: Hinweis

# Embed_TradeCanceled_Title
source: Your Trade was Canceled...
de: Dein Tausch wurde abgebrochen...

# Embed_TradeCanceled_Description
source: Your trade was canceled. Please try again. If the issue persists, restart your switch and check your internet connection. **Reason**: {0}
de: Dein Tausch wurde abgebrochen. Bitte versuche es erneut. Falls das Problem weiterhin besteht, starte deine Switch neu und überprüfe deine Internetverbindung. **Grund**: {0}

# Embed_TradeCode_Title
source: Here's your trade code!
de: Hier ist dein Tauschcode!

# Embed_TradeCompleted_Title
source: Trade Completed!
de: Tausch abgeschlossen!

# Embed_TradeInitializing_Title
source: Loading the Trade Portal...
de: Lade das Tausch-Portal...

# Embed_TradeInitializing_Description
source: **Pokemon**: {0} **Trade Code**: {1:0000 0000}
de: **Pokémon**: {0} **Tauschcode**: {1:0000 0000}

# Embed_TradeSearching_Title
source: Now Searching for You, {0}...
de: Suche jetzt nach dir, {0}...

# Embed_TradeSearching_Description
source: **Waiting for**: {0} **My IGN**: {1}
de: **Warte auf**: {0} **Mein IGN**: {1}

# Embed_MysteryEgg
source: **Mystery Egg**
de: **Mysteriöses Ei**

# Embed_GetReady_Title
source: 🎯 You're Up Next!
de: 🎯 Du bist als Nächstes dran!

# Embed_GetReady_Description
source: Your trade will begin very soon. Please be ready!{0}
de: Dein Tausch beginnt gleich. Bitte halte dich bereit!{0}

# Embed_GetReady_Footer
source: Get ready to connect!
de: Mach dich bereit!

# Embed_TradeQueued_Title
source: Trade Request Queued
de: Tauschantrag in Warteschlange

# Embed_TradeQueued_Description
source: Your trade request has been queued. Position in queue: **{0}**
de: Dein Tauschantrag wurde in die Warteschlange eingereiht. Position in der Warteschlange: **{0}**

# Embed_BatchTradeQueued_Title
source: 🎁 Batch Trade Request Queued
de: 🎁 Batch-Tausch in Warteschlange

# Embed_BatchTradeQueued_Description
source: Your batch trade request ({0} Pokémon) has been queued. ⚠️ **Important Instructions:** • Stay in the trade for all {0} trades • Have all {0} Pokémon ready to trade • Do not exit until you see the completion message Position in queue: **{1}**
de: Dein Batch-Tausch ({0} Pokémon) wurde in die Warteschlange eingereiht. ⚠️ **Wichtige Hinweise:** • Bleibe für alle {0} Tauschvorgänge im Tauschmenü • Halte alle {0} Pokémon zum Tausch bereit • Verlasse den Tausch nicht, bis du die Abschlussnachricht siehst Position in der Warteschlange: **{1}**

# Embed_QueueFooter
source: Estimated wait time: {0}
de: Geschätzte Wartezeit: {0}

# Embed_LessThanMinute
source: Less than a minute
de: Weniger als eine Minute

# Embed_Minutes
source: {0} minutes
de: {0} Minuten

# Trade_WaitingFor
source: I'm waiting for you{0}{1}! My IGN is **{2}**.
de: Ich warte auf dich{0}{1}! Mein IGN ist **{2}**.

# Trade_BatchStarting
source: Starting batch trade ({0} Pokémon total). **Please select your first Pokémon!**
de: Starte Batch-Tausch (insgesamt {0} Pokémon). **Bitte wähle dein erstes Pokémon aus!**

# Trade_BatchSelectNext
source: Trade {0}/{1}: Now trading {2}. **Select your next Pokémon!**
de: Tausch {0}/{1}: Tausche jetzt {2}. **Wähle dein nächstes Pokémon aus!**

# Trade_BatchCanceled
source: Batch trade canceled: {0}. All remaining trades have been canceled.
de: Batch-Tausch abgebrochen: {0}. Alle verbleibenden Tauschvorgänge wurden abgebrochen.

source: Trade finished!
de: Tausch abgeschlossen!

source: Trade finished. Enjoy!
de: Tausch abgeschlossen. Viel Spaß!

# Trade_HereIsWhatYouTraded
source: Here's what you traded me!
de: Hier ist, was du mir getauscht hast!

# Trade_InitializingBatch
source: Starting your batch trade! Trading {0} Pokémon. {1}
de: Starte deinen Batch-Tausch! Tausche {0} Pokémon. {1}

# Trade_InitializingBatchProgress
source: Preparing trade {0}/{1}: {2}{3}
de: Bereite Tausch {0}/{1} vor: {2}{3}

# Trade_InitializingSingle
source: Initializing trade{0}. Please be ready.
de: Initialisiere Tausch{0}. Bitte halte dich bereit.

# Trade_PreparingNext
source: Preparing trade {0}/{1}...
de: Bereite Tausch {0}/{1} vor...

# Trade_YourCodeIs
source: Initializing trade{0}. Please be ready. Your code is
de: Initialisiere Tausch{0}. Bitte halte dich bereit. Dein Code ist
